app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Development 101"], ["room_number", 400], ["created_at", "2019-11-26 01:45:52.376100"], ["updated_at", "2019-11-26 01:45:52.376100"]]
---
    def create
        school_class = SchoolClass.create(class_params)

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 300], ["updated_at", "2019-11-26 01:53:38.434027"], ["id", 2]]
---
    def update
        school_class = SchoolClass.find(params[:id])
        school_class.update(class_params)