app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Luke"], ["last_name", "Waring"], ["created_at", "2019-11-21 23:04:24.494944"], ["updated_at", "2019-11-21 23:04:24.494944"]]
---
    def create
    @student = Student.new(student_params)
    @student.save